#include <stdio.h>

int main01()
{
	//输出整型---年龄
	printf("年龄：%d\n", 18);

	//输出实型---身高
	printf("身高；%.3f\n", 1.78);

	//输出字符型---血型
	printf("血型：%c\n", 'B');

	//输出字符串---大学
	printf("学校：%s\n", "浙江大学");

	printf("%lf\n", 123.);

	printf("%lf\n", 123e-6);

	printf("%lf\n", 123e7);

	printf("%lf\n", .123);



	/*练习：输出以下内容：

		​	我亲亲女朋友的姓名是：小诗诗。性别：女。年龄：18岁。身高：1米82。体重：110斤。

		​	要求：女朋友的姓名，性别，年龄，身高，体重等信息需要结合占位符的形式进行输出
	*/
	printf("姓名是：%s。性别：%s。年龄：%d岁。身高：%f。体重：%d斤。", "小诗诗", "女", 18, 1.82, 110);

	return 0;
}